# Ошибки представления чисел и ошибки округления

print('Проверка равенства 0.1 == 0.10000000000000001')
print(0.1 == 0.10000000000000001)

print('Проверка равенства 0.1 == 0.1000000000000001')
print(0.1 == 0.1000000000000001)

print('Проверка равенства 0.1+0.1+0.1 == 0.3')
print(0.1+0.1+0.1 == 0.3)

print('Проверка равенства 0.1+0.1 == 0.2')
print(0.1+0.1 == 0.2)

print('Проверка равенства 0.125+0.125+0.125+0.125 == 0.5')
print(0.125+0.125+0.125+0.125 == 0.5)

def gen(n):
    import random as rnd
    A = []
    for _ in range(n):
        A.append(rnd.random())
    return A

if __name__ == "__main__":
    import copy
    import random
    n = 10000000
    A = gen(n)
    B = copy.copy(A)
    C = copy.copy(A)
    D = copy.copy(A)
    B.sort(reverse=True)
    C.sort()
    random.shuffle(D)
    print(f'Список из {n} случайных чисел')
    print(sum(A) / n, '- среднее несортированного списка')
    print(sum(B) / n, '- среднее списка, отсортированного по убыванию')
    print(sum(C) / n, '- среднее списка, отсортированного по возрастанию')
    print(sum(D) / n, '- среднее перемешанного списка')
