# решение системы линейных уравнений и почти нулевым
# определителем матрицы коэффициентов
# система неустойчива и чувствительна к вычислительным погрешностям

A = [[0.780, 0.563], [0.457, 0.330]]
B = [0.217, 0.127]

x2 = (B[1] - A[1][0]*B[0] / A[0][0]) / (A[1][1] - A[1][0]*A[0][1] / A[0][0])
x1 = (B[0] - A[0][1]*x2) / A[0][0]
detA = A[0][0]*A[1][1] - A[0][1]*A[1][0]

print('-- Неустойчивая система уравнений --')
print('A =', A)
print('B =', B)
print('detA =', detA)
print('x1 =', x1)
print('x2 =', x2)
print()

A = [[1, 2], [2, 1]]
B = [-1, 1]

x2 = (B[1] - A[1][0]*B[0] / A[0][0]) / (A[1][1] - A[1][0]*A[0][1] / A[0][0])
x1 = (B[0] - A[0][1]*x2) / A[0][0]
detA = A[0][0]*A[1][1] - A[0][1]*A[1][0]

print('-- Устойчивая система уравнений --')
print('A =', A)
print('B =', B)
print('detA =', detA)
print('x1 =', x1)
print('x2 =', x2)
print()

